Documents/си_ВыработкаМатериаловВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>си_ВыработкаМатериаловВЭксплуатации</Name>
			<BasedOn>
				<xr:Item>Document.си_ПередачаМатериаловВЭксплуатацию</xr:Item>
				<xr:Item>Document.си_ПеремещениеМатериаловВЭксплуатации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.си_ВыработкаМатериаловВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОборотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/си_ВыработкаМатериаловВЭксплуатации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения,ТаблицаДокумента)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПроведения = Документы.си_ВыработкаМатериаловВЭксплуатации.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.СформироватьДвиженияПоРегистрам(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаМатериалы, Движения, Отказ,"Материалы",,,"си_ВыработкаМатериаловВЭксплуатации",);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Отказ = си_УчетСпецодеждыСервер.ПроверкаЗаполненияСтруктурнойЕдиницы(Организация,СтруктурноеПодразделение);
	
	Для Каждого СтрокаМатериал Из Материалы Цикл
		Если НЕ СтрокаМатериал.НазначениеИспользования.СпособПогашенияСтоимости = Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда 
			ТекстСообщения = "Проведение документа невозможно. Для материалов указан не производственный способ погашения стоимости.";
			ОбщегоНазначения.СообщитьПользователю("Проведение """ + Ссылка + """" + ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.си_ПередачаМатериаловВЭксплуатацию") Тогда
		// Заполнение шапки
		ВидУчетаНУ = ДанныеЗаполнения.ВидУчетаНУ;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		РучнаяКорректировка = ДанныеЗаполнения.РучнаяКорректировка;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтруктурноеПодразделение = ДанныеЗаполнения.СтруктурноеПодразделение;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		
		Для Каждого ВыборкаПоТоварам Из ДанныеЗаполнения.Материалы Цикл
			Если ВыборкаПоТоварам.НазначениеИспользования.СпособПогашенияСтоимости<>Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ВыборкаПоТоварам.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ВыборкаПоТоварам.Количество;
			НоваяСтрока.Коэффициент = ВыборкаПоТоварам.Коэффициент;
			НоваяСтрока.НазначениеИспользования = ВыборкаПоТоварам.НазначениеИспользования;
			НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
			НоваяСтрока.Сотрудник = ВыборкаПоТоварам.Сотрудник;
			НоваяСтрока.Характеристика = ВыборкаПоТоварам.Характеристика;
			НоваяСтрока.ДокументПередачи = ?(ДанныеЗаполнения.ВидОперации = Перечисления.си_ВидыОперацийПередачиВЭксплуатацию.ПервичнаяПередача,ДанныеЗаполнения.Ссылка,ВыборкаПоТоварам.ДокументПередачи);
		КонецЦикла;
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.си_ПеремещениеМатериаловВЭксплуатации") Тогда
		// Заполнение шапки
		ВидУчетаНУ = ДанныеЗаполнения.ВидУчетаНУ;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизацииПолучатель;
		РучнаяКорректировка = ДанныеЗаполнения.РучнаяКорректировка;
		Склад = ДанныеЗаполнения.СкладПолучатель;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтруктурноеПодразделение = ДанныеЗаполнения.СтруктурноеПодразделениеПолучатель;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		СостояниеМатериалов = ДанныеЗаполнения.СостояниеМатериалов;
		УчитыватьКПН = ДанныеЗаполнения.УчитыватьКПН;
		
		Для Каждого ВыборкаПоТоварам Из ДанныеЗаполнения.Материалы Цикл
			Если ВыборкаПоТоварам.НазначениеИспользования.СпособПогашенияСтоимости<>Перечисления.си_СпособыПогашенияСтоимости.Производственный Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ВыборкаПоТоварам.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ВыборкаПоТоварам.Количество;
			НоваяСтрока.Коэффициент = ВыборкаПоТоварам.Коэффициент;
			НоваяСтрока.НазначениеИспользования = ВыборкаПоТоварам.НазначениеИспользованияПолучатель;
			НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номенклатура;
			НоваяСтрока.Сотрудник = ВыборкаПоТоварам.СотрудникПолучатель;
			НоваяСтрока.ДокументПередачи = ВыборкаПоТоварам.ДокументПередачи;
			НоваяСтрока.Характеристика = ВыборкаПоТоварам.Характеристика;
		КонецЦикла;
		возврат;
	КонецЕсли;
	общ_ПереопределяемыеПроцедурыБКСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
